pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
/** read hardware MAC */
#define MAC_CTRL_ID 0x50
bool OpenSprinkler::read_hardware_mac()
{
#if defined(ESP8266) || defined(ESP32)
	byte mac[6];
	if(!WiFi.macAddress(mac)) return false;
	for (byte i = 0; i < 6; i++) tmp_buffer[i ]= mac[i]; 
#else
    uint8_t ret;
    Wire.beginTransmission ( MAC_CTRL_ID );
    Wire.write ( ( uint8_t ) ( 0x00 ) );
    ret = Wire.endTransmission();
    if ( ret )  return false;

    Wire.beginTransmission ( MAC_CTRL_ID );
    Wire.write ( 0xFA ); // The address of the register we want
    Wire.endTransmission(); // Send the data
    Wire.requestFrom ( MAC_CTRL_ID, 6 ); // Request 6 bytes from the EEPROM
    while ( !Wire.available() ); // Wait for the response
    for ( ret=0; ret<6; ret++ )
    {
        tmp_buffer[ret] = Wire.read();
    }
#endif
    return true;
}

void ( * resetFunc ) ( void ) = 0; // AVR software reset function

/** Initialize network with the given mac address and http port */
byte OpenSprinkler::start_network( )
{

    lcd_print_line_clear_pgm ( PSTR ( "Connecting..." ), 1 );
    DEBUG_PRINTLN ( F ( "Connecting..." ) );

    // new from 2.2: read hardware MAC
#if defined( OPENSPRINKLER_ARDUINO) && !defined(ESP8266)
    // always use software MAC
    DEBUG_PRINTLN ( F ( "Setting software MAC " ) );
    tmp_buffer[0] = 0x00;
    tmp_buffer[1] = 0x69;
    tmp_buffer[2] = 0x69;
    tmp_buffer[3] = 0x2D;
    tmp_buffer[4] = 0x31;
    tmp_buffer[5] = options[OPTION_DEVICE_ID];
#else
    if ( !read_hardware_mac() )
    {
        // if no hardware MAC exists, use software MAC
        tmp_buffer[0] = 0x00;
        tmp_buffer[1] = 0x69;
        tmp_buffer[2] = 0x69;
        tmp_buffer[3] = 0x2D;
        tmp_buffer[4] = 0x31;
        tmp_buffer[5] = options[OPTION_DEVICE_ID];
    }
    else
    {
        // has hardware MAC chip
        status.has_hwmac = 1;
    }
#endif

    if ( !ether.begin ( ETHER_BUFFER_SIZE, ( uint8_t* ) tmp_buffer, PIN_ETHER_CS ) )
    {
        DEBUG_PRINTLN ( F ( "Ethernet initialisation failed - check wiring" ) );
        return 0;
    }
    else
    {
        DEBUG_PRINTLN ( F ( "Ethernet initialised" ) );
    }

    // calculate http port number
    ether.hisport = ( unsigned int ) ( options[OPTION_HTTPPORT_1]<<8 ) + ( unsigned int ) options[OPTION_HTTPPORT_0];
    DEBUG_PRINT ( F ( "Using http port " ) );
    DEBUG_PRINTLN ( ether.hisport );

    if ( options[OPTION_USE_DHCP] )
    {
        // set up DHCP
        // register with domain name "OS-xx" where xx is the last byte of the MAC address
		DEBUG_PRINT(F("DHCP IP setup"));
        if ( !ether.dhcpSetup() )
        {
            DEBUG_PRINTLN ( F ( " failed" ) );
			write_message("DHCP conn. failed");
            return 0;
        }

        // once we have valid DHCP IP, we write these into static IP / gateway IP
        byte *ip = ether.myip;
        options[OPTION_STATIC_IP1] = ip[0];
        options[OPTION_STATIC_IP2] = ip[1];
        options[OPTION_STATIC_IP3] = ip[2];
        options[OPTION_STATIC_IP4] = ip[3];

        ip = ether.gwip;
        options[OPTION_GATEWAY_IP1] = ip[0];
        options[OPTION_GATEWAY_IP2] = ip[1];
        options[OPTION_GATEWAY_IP3] = ip[2];
        options[OPTION_GATEWAY_IP4] = ip[3];
        options_save();
        DEBUG_PRINTLN ( F ( "DHCP IP setup successful" ) );
    }
    else
    {
        // set up static IP
        byte staticip[] =
        {
            options[OPTION_STATIC_IP1],
            options[OPTION_STATIC_IP2],
            options[OPTION_STATIC_IP3],
            options[OPTION_STATIC_IP4]
        };

        byte gateway[] =
        {
            options[OPTION_GATEWAY_IP1],
            options[OPTION_GATEWAY_IP2],
            options[OPTION_GATEWAY_IP3],
            options[OPTION_GATEWAY_IP4]
        };

		DEBUG_PRINT(F("Static IP setup "));

        if ( !ether.staticSetup ( staticip, gateway, gateway ) )
        {
            DEBUG_PRINTLN ( F ( "failed" ) );
			write_message("Static conn. failed");
            return 0;
        }
        else
        {
            DEBUG_PRINTLN ( F ( "successful" ) );
        }
    }
    DEBUG_PRINTLN ( F ( "Ethernet setup complete" ) );
    return 1;
}

/** Reboot controller */
void OpenSprinkler::reboot_dev()
{
#if defined(ESP8266) || defined(ESP32)
//	eeprom_write_byte((unsigned char *)(NVM_SIZE - 1), byte(charge / 25));
	write_message("restart");
	Serial.println("REBOOT.........");
	ESP.restart();
#else

    resetFunc();
#endif
}

#else // RPI/BBB/LINUX network init functions

#include "etherport.h"
#include <sys/reboot.h>
#include <stdlib.h>
#include "utils.h"
#include "server.h"

extern EthernetServer *m_server;
extern char ether_buffer[];

/** Initialize network with the given mac address and http port */
byte OpenSprinkler::start_network()
{
    unsigned int port = ( unsigned int ) ( options[OPTION_HTTPPORT_1]<<8 ) + ( unsigned int ) options[OPTION_HTTPPORT_0];
#if defined(DEMO)
    port = 80;
#endif
    if ( m_server )
    {
        delete m_server;
        m_server = 0;
    }

    m_server = new EthernetServer ( port );
    return m_server->begin();
}

/** Reboot controller */
void OpenSprinkler::reboot_dev()
{
#if defined(DEMO)
    // do nothing
#else
    sync(); // add sync to prevent file corruption
    reboot ( RB_AUTOBOOT );
#endif
}

LiquidCrystal_I2C OpenSprinkler::lcd(byte a, byte b, byte c, byte d, byte e, byte f, byte g, byte l)
{
	return LiquidCrystal_I2C();
}

/** Launch update script */
void OpenSprinkler::update_dev()
{
    char cmd[1024];
    sprintf ( cmd, "cd %s & ./updater.sh", get_runtime_path() );
    system ( cmd );
}
#endif // end network init functions

#if defined(ARDUINO)
/** Initialize LCD */
void OpenSprinkler::lcd_start()
{
#ifdef OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
    //set up the LCD number of columns and rows:
    lcd.begin ( 16, 2 );
#else
    // turn on lcd
#ifndef LCDI2C
    lcd.init ( 1, PIN_LCD_RS, 255, PIN_LCD_EN, PIN_LCD_D4, PIN_LCD_D5, PIN_LCD_D6, PIN_LCD_D7, 0,0,0,0 );
    lcd.begin();

