pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
	}
#endif
#ifdef OPENSPRINKLER_ARDUINO_DISCRETE
#ifdef OSBEE
#if OSBEE == 1	
	setallpins(HIGH);
#else
	// initialize the Digital IO pins as outputs:
	for (int i = 0; i < (PIN_EXT_BOARDS * 8); i++)
	{		pinMode(station_pins[i], OUTPUT);

}
//	for (int i = 0; i < MAX_NUMBER_ZONES; i++) BeeClose(i);
  #endif
#endif
#else
    // shift register setup
#ifdef PIN_SR_OE
    PINMODE ( PIN_SR_OE, OUTPUT );

    // pull shift register OE high to disable output
    digitalWrite ( PIN_SR_OE, HIGH );
#endif
	DEBUG_PRINTLN(PIN_SR_LATCH);
    pinMode ( PIN_SR_LATCH, OUTPUT );
    digitalWrite ( PIN_SR_LATCH, HIGH );
    pinMode ( PIN_SR_CLOCK, OUTPUT );
#endif // OPENSPRINKLER_ARDUINO_DISCRETE

#if defined(OSPI)
    pin_sr_data = PIN_SR_DATA;
    // detect RPi revisionOPENSPRINKLER_ARDUINO_DISCRETE
    unsigned int rev = detect_rpi_rev();
    if ( rev==0x0002 || rev==0x0003 )
        pin_sr_data = PIN_SR_DATA_ALT;
    // if this is revision 1, use PIN_SR_DATA_ALT
    PINMODE ( pin_sr_data, OUTPUT );
#else
#ifndef OPENSPRINKLER_ARDUINO_DISCRETE
    pinMode ( PIN_SR_DATA,  OUTPUT );
#endif
#endif

    // Reset all stations
    clear_all_station_bits();
    apply_all_station_bits();

#ifndef OPENSPRINKLER_ARDUINO_DISCRETE
#ifdef PIN_SR_OE
	// pull shift register OE low to enable output
    digitalWrite ( PIN_SR_OE, LOW );
#endif
#endif // OPENSPRINKLER_ARDUINO_DISCRETE
#ifdef PIN_RAINSENSOR
    // Rain sensor port set up
    pinMode ( PIN_RAINSENSOR, INPUT );

    // Set up sensors
#if defined(ARDUINO)
	digitalWrite ( PIN_RAINSENSOR, HIGH ); // enabled internal pullup on rain sensor         //ESP32_ER
    attachInterrupt ( PIN_FLOWSENSOR_INT, flow_isr, FALLING );
#else
    // OSPI and OSBO use external pullups
    attachInterrupt ( PIN_FLOWSENSOR, "falling", flow_isr );
#endif
#endif
    // Default controller status variables
    // Static variables are assigned 0 by default
    // so only need to initialize non-zero ones
    status.enabled = 1;
    status.safe_reboot = 0;

    old_status = status;

    nvdata.sunrise_time = 360;  // 6:00am default sunrise
    nvdata.sunset_time = 1080;  // 6:00pm default sunset

    nboards = 1;
    nstations = 8;

#ifdef PIN_RF_DATA
    // set rf data pin
    PINMODE ( PIN_RF_DATA, OUTPUT );
    digitalWrite ( PIN_RF_DATA, LOW );
#endif

    hw_type = HW_TYPE_AC;
#if defined(ARDUINO)  // AVR SD and LCD functions
 
	

#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__) // OS 2.3 specific detections
    uint8_t ret;

    // detect hardware type
    Wire.beginTransmission ( MAC_CTRL_ID );
    Wire.write ( 0x00 );
    ret = Wire.endTransmission();
    if ( !ret )
    {
        Wire.requestFrom ( MAC_CTRL_ID, 1 );
        while ( !Wire.available() );
        ret = Wire.read();
        if ( ret == HW_TYPE_AC || ret == HW_TYPE_DC || ret == HW_TYPE_LATCH )
        {
            hw_type = ret;
        }
        else
        {
            // hardware type is not assigned
        }
    }

    if ( hw_type == HW_TYPE_DC )
    {
        PINMODE ( PIN_BOOST, OUTPUT );
        digitalWrite ( PIN_BOOST, LOW );

        PINMODE ( PIN_BOOST_EN, OUTPUT );
        digitalWrite ( PIN_BOOST_EN, LOW );
    }

    // detect if current sensing pin is present
    PINMODE ( PIN_CURR_DIGITAL, INPUT );
    digitalWrite ( PIN_CURR_DIGITAL, HIGH ); // enable internal pullup
    status.has_curr_sense = digitalRead ( PIN_CURR_DIGITAL ) ? 0 : 1;
    digitalWrite ( PIN_CURR_DIGITAL, LOW );
#endif

   
#ifndef LCD_SSD1306
    // define lcd custom icons
    byte _icon[8];
    // WiFi icon
    _icon[0] = B00000;
    _icon[1] = B10100;
    _icon[2] = B01000;
    _icon[3] = B10101;
    _icon[4] = B00001;
    _icon[5] = B00101;
    _icon[6] = B00101;
    _icon[7] = B10101;
    lcd.createChar ( 1, _icon );

    _icon[1]=0;
    _icon[2]=0;
    _icon[3]=1;
    lcd.createChar ( 0, _icon );

    // uSD card icon
    _icon[1] = B00000;
    _icon[2] = B11111;
    _icon[3] = B10001;
    _icon[4] = B11111;
    _icon[5] = B10001;
    _icon[6] = B10011;
    _icon[7] = B11110;
    lcd.createChar ( 2, _icon );

    // Rain icon
    _icon[2] = B00110;
    _icon[3] = B01001;
    _icon[4] = B11111;
    _icon[5] = B00000;
    _icon[6] = B10101;
    _icon[7] = B10101;
    lcd.createChar ( 3, _icon );

    // Connect icon
    _icon[2] = B00111;
    _icon[3] = B00011;
    _icon[4] = B00101;
    _icon[5] = B01000;
    _icon[6] = B10000;
    _icon[7] = B00000;
    lcd.createChar ( 4, _icon );

    // Remote extension icon
    _icon[2] = B00000;
    _icon[3] = B10001;
    _icon[4] = B01011;
    _icon[5] = B00101;
    _icon[6] = B01001;
    _icon[7] = B11110;
    lcd.createChar ( 5, _icon );

    // Flow sensor icon
    _icon[2] = B00000;
    _icon[3] = B11010;
    _icon[4] = B10010;
    _icon[5] = B11010;
    _icon[6] = B10011;
    _icon[7] = B00000;
    lcd.createChar ( 6, _icon );

#endif
#ifdef SDFAT 

    // set sd cs pin high to release SD
    pinMode ( PIN_SD_CS, OUTPUT );
    digitalWrite ( PIN_SD_CS, HIGH );
#if !defined(ESP8266) && !defined(ESP32)
    if ( sd.begin(PIN_SD_CS, SPI_HALF_SPEED))
#else
	if(SD.begin(PIN_SD_CS, SPI_HALF_SPEED))
#endif
    {
        status.has_sd = 1;
    }


#else
	long tot = 0;

	DEBUG_PRINT("Start SPIFFS....");

#ifndef ESP32
	 if (SPIFFS.begin()) 
#else
	 if(SPIFFS.begin(true))
#endif
	{
		 status.has_sd = 1;
		 DEBUG_PRINTLN("started!");
		 delay(500);
#ifdef LORA //read loranet.dat file that contain manual LORA MESH connections 1 line per connection
		 if (SPIFFS.exists("/loranet.dat"))
		 {
			 byte str[10],c=0, i = 0; long longval=0;
			 File file = SPIFFS.open("/loranet.dat", "r+");
			 DEBUG_PRINTLN("reading LoraNet file");
			 while (file.available()) {
				 c = file.read();
				 if (c == '/')
				 {
					 longval = longval * 256 + i;
					 DEBUG_PRINT(i); DEBUG_PRINT("/"); DEBUG_PRINTLN(longval);
					 i = 0;
				 }
				 else
					 if (c == 10) {
						 longval = longval * 256 + i;
						 DEBUG_PRINT(i); DEBUG_PRINT("/");
						 Lora.routing[i] = longval;
						 Serial.println(longval, HEX);
						 longval = 0;
						
