pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
    // Shift out all station bit values from the highest bit to the lowest
	for (bid = 0; bid <= MAX_EXT_BOARDS; bid++)
	{

		if (status.enabled)
		{
			sbits = station_bits[MAX_EXT_BOARDS - bid];
	//		DEBUG_PRINT(int(bid)); DEBUG_PRINT("sb="); DEBUG_PRINTLN(int(sbits));
		}
        else
            sbits = 0;
#ifdef OSBEE
	//  PROCESS ONLY IF BITS ARE CHANGED !!!!!!!!!!!!!!!!!!!!!!!!
		if (bid == MAX_EXT_BOARDS)                    //only for this station not for extension or remotes
			if (sbits == prev_bits) return;
#endif

		if (MAX_EXT_BOARDS - bid < PIN_EXT_BOARDS)

		{			
			for (s = 0; s < 8; s++)
			{

#ifdef OSBEE
				if (bid == MAX_EXT_BOARDS) {
					if ((sbits & ((byte)1 << (MS7))) != (prev_bits & ((byte)1 << (MS7))))
						if (sbits & ((byte)1 << (MS7)))

						{
							BeeOpen(s);
							DEBUG_PRINT("============open "); DEBUG_PRINTLN(s);
						//	lcd.setCursor(s * 10 + 20, 30);
						//	lcd.print('*');
						}
						else
						{
							BeeClose(s);
							DEBUG_PRINT("===========closed "); DEBUG_PRINTLN(s);
						//	lcd.setCursor(s * 10 + 20, 30);
						//	lcd.print(' ');
						}
				}
				else
#endif
				{
					//	DEBUG_PRINT(station_pins[(bid * 8) + s]);
					byte sBit = (sbits & ((byte)1 << (MS7))) ? STA_HIGH : STA_LOW;
					//DEBUG_PRINTF(sBit,DEC);
					digitalWrite(station_pins[((MAX_EXT_BOARDS - bid) * 8) + s], sBit);
			    }

			}
			if (bid == MAX_EXT_BOARDS) {
				DEBUG_PRINT("s "); DEBUG_PRINT(bid); DEBUG_PRINT(" b = "); DEBUG_PRINT(int(prev_bits)); DEBUG_PRINT("  "); DEBUG_PRINTLN(int(sbits));
				prev_bits = sbits;
			}
		}
		
    }
	
#else //ARDUINO DISCRETE
    digitalWrite ( PIN_SR_LATCH, LOW );
    byte bid, s, sbits;
    // Shift out all station bit values
    // from the highest bit to the lowest
    for ( bid=0; bid<=MAX_EXT_BOARDS; bid++ )
    {
        if ( status.enabled )
            sbits = station_bits[MAX_EXT_BOARDS-bid];
        else
            sbits = 0;

        for ( s=0; s<8; s++ )
        {
            digitalWrite ( PIN_SR_CLOCK, LOW );
#if defined(OSPI) // if OSPI, use dynamically assigned pin_sr_data
            digitalWrite ( pin_sr_data, ( sbits & ( ( byte ) 1<< ( MS7 ) ) ) ? HIGH : LOW );
#endif
#ifndef OSPI
			byte y = (sbits & ((byte)1 << (MS7))) ? HIGH : LOW;
			digitalWrite ( PIN_SR_DATA, (sbits & ((byte)1 << (MS7))) ? HIGH : LOW);
#endif
            digitalWrite ( PIN_SR_CLOCK, HIGH );
        }
    }

#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
    if ( ( hw_type==HW_TYPE_DC ) && engage_booster )
    {
        DEBUG_PRINTLN ( F ( "engage booster" ) );
        // for DC controller: boost voltage
        digitalWrite ( PIN_BOOST_EN, LOW ); // disable output path
        digitalWrite ( PIN_BOOST, HIGH ); // enable boost converter
        delay ( ( int ) options[OPTION_BOOST_TIME]<<2 ); // wait for booster to charge
        digitalWrite ( PIN_BOOST, LOW );  // disable boost converter
        digitalWrite ( PIN_BOOST_EN, HIGH ); // enable output path
        digitalWrite ( PIN_SR_LATCH, HIGH );
        engage_booster = 0;
    }
    else
    {
        digitalWrite ( PIN_SR_LATCH, HIGH );
    }
#else
    digitalWrite ( PIN_SR_LATCH, HIGH );
#endif
#endif // OPENSPRINKLER_ARDUINO_DISCRETE

    // handle refresh of RF and remote stations
    // each time apply_all_station_bits is called
    // we refresh the station whose index is the current time modulo MAX_NUM_STATIONS
    static byte last_sid = 0;
    byte sid = abs(now()) % MAX_NUM_STATIONS;
    if ( sid != last_sid )  // avoid refreshing the same station twice in a roll
    {
        last_sid = sid;
        bid=sid>>3;
        s=sid&0x07;
        switch_special_station ( sid, ( station_bits[bid]>>s ) &0x01 );
    }

}
#ifdef BATTERY
#define SLEEPING_VOLTS		options[MIN_VOLTS_L_SLEEP]*10  //unit 10mV options unit is 100mV  
#define DEEP_SLEEP_VOLTS	options[MIN_VOLTS_D_SLEEP]*10  //unit 10mV options unit is 100mV  
#define DEEP_SLEEP_TIME		options[D_SLEEP_DURATION]*60   //seconds option is in minutes
#define SLEEP_START			options[D_SLEEP_START_TIME] // hours
#define SLEEP_DURATION		options[D_SLEEP_INTERVAL]   // hours
#define L_SLEEP_TIME		options[L_SLEEP_DURATION]      //seconds
#define FACTOR 0.8

static int voltAverage, vcount = 0, sleeptime = 30;
/*
#define SLEEPING_VOLTS 330
#define DEEP_SLEEP_VOLTS 320
#define DEEP_SLEEP_TIME 3600UL   // 1 hour
#define SLEEP_START 20*60
#define SLEEP_DURATION 10*60

*/
#define BOTTOM 64-9


void OpenSprinkler::Sleep(int volts) {
//	DEBUG_PRINT("V="); DEBUG_PRINTLN(SLEEPING_VOLTS);
	bool sleepFlag = false;
// in the interval for sleeping!!!
	if (hour() > SLEEP_START) { if (hour() - SLEEP_START < SLEEP_DURATION) sleepFlag = true; }
	else { if (SLEEP_START + SLEEP_DURATION > 24) if (hour() < SLEEP_START + SLEEP_DURATION - 24)sleepFlag = true; }
//////
	if (volts>=100)
		if (volts < DEEP_SLEEP_VOLTS&&sleepFlag)
		{
			lcd.clearDisplay();
			lcd.setCursor(0, BOTTOM);
			lcd.print(volts / 100.); lcd.print(" sleep...");
			unsigned int sleepTime = DEEP_SLEEP_TIME;
			lcd_print_2digit(hour(now_tz() + sleepTime)); lcd.print(":");
			lcd_print_2digit(minute(sleepTime+now_tz()));
			lcd.display();
			ESP.deepSleep(DEEP_SLEEP_TIME*1000000);    // sleep for 1 hour waik up and sleep again if battery is empty   
			
		}
		else 	if(volts < SLEEPING_VOLTS) {
//		WiFi.setSleepMode(WIFI_LIGHT_SLEEP);
//		wifi_fpm_set_sleep_type(LIGHT_SLEEP_T);
		lcd.setCursor(30, BOTTOM); 
		lcd.print("zzzzz"); 
		lcd.display();
		wifi_set_sleep_type(LIGHT_SLEEP_T);
		delay(L_SLEEP_TIME * 1000L);
		lcd.setCursor(100, BOTTOM);
		lcd.print("z");
		lcd.display();
		
	}
	else {
	//	lcd.setCursor(30, BOTTOM);
	//	lcd.print(volts);
	}
}
void OpenSprinkler::ShowNet() {
	if (second() % 60 == 0) {
		byte level = ether.WiFiLevel(0);
		DEBUG_PRINT("NetLev."); DEBUG_PRINTLN(level);
#define NET_X 19*XFACTOR
#define NET_Y BOTTOM-1
#define NET_S 150
		lcd.setCursor(NET_X-5, NET_Y);
		lcd.print("  ");

		lcd.drawBitmap(NET_X - 5, NET_Y, antenna5x9_bmp, 5, 9, WHITE);
		lcd.drawBitmap(NET_X , NET_Y, blank24x18_bmp, 10, 10, BLACK);

		lcd.drawTriangle(NET_X , NET_Y+YFACTOR,
			NET_X + (level*XFACTOR) / NET_S, NET_Y+YFACTOR,
			NET_X + (level*XFACTOR) / NET_S, NET_Y+YFACTOR - (YFACTOR*level) / NET_S, WHITE);
		lcd.display();
		
