pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
/** verify if a string matches password */
byte OpenSprinkler::password_verify ( char *pw )
{
    byte *addr = ( byte* ) ADDR_NVM_PASSWORD;
    byte c1, c2;
    while ( 1 )
    {
        if ( addr == ( byte* ) ADDR_NVM_PASSWORD+MAX_USER_PASSWORD )
            c1 = 0;
        else
            c1 = nvm_read_byte ( addr++ );
        c2 = *pw++;
        if ( c1==0 || c2==0 )
            break;
        if ( c1!=c2 )
        {
            return 0;
        }
    }
    return ( c1==c2 ) ? 1 : 0;
}

// ==================
// Schedule Functions
// ==================

/** Index of today's weekday (Monday is 0) */
byte OpenSprinkler::weekday_today()
{
    //return ((byte)weekday()+5)%7; // Time::weekday() assumes Sunday is 1
#if defined(ARDUINO)
    ulong wd = now_tz() / 86400L;
    return ( wd+3 ) % 7; // Jan 1, 1970 is a Thursday
#else
    return 0;
    // todo: is this function needed for RPI/BBB?
#endif
}

/** Switch special station */
void OpenSprinkler::switch_special_station ( byte sid, byte value ){
    // check station special bit

    if ( station_attrib_bits_read ( ADDR_NVM_STNSPE+ ( sid>>3 ) ) & ( 1<< ( sid&0x07 ) ) ){
        // read station special data from sd card
        int stepsize=sizeof ( StationSpecialData );
        read_from_file ( stns_filename, tmp_buffer, stepsize, sid*stepsize );
        StationSpecialData *stn = ( StationSpecialData * ) tmp_buffer;
        // check station type

#ifdef LORA
#define STN_TYPE_LORA 1    /// LORA replace RF station UI app need mod.
		if (stn->type == STN_TYPE_LORA) { 
			// STN_TYPE_LORA==6  sd contain station number, name , otions,comma separated
			switch_LoraStation(stn->data, value);
		} else
#endif
        if ( stn->type==STN_TYPE_RF ){
            // transmit RF signal

#ifdef OS217
			switch_rfstation((RFStationData *)stn->data, value);
		}else if (stn->type == STN_TYPE_REMOTE) {
			// request remote station
			switch_remotestation((RemoteStationData *)stn->data, value);
		}
#if !defined(ARDUINO) || defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
		// GPIO and HTTP stations are only available for OS23 or OSPi
		else if (stn->type == STN_TYPE_GPIO) {
			// set GPIO pin
			switch_gpiostation((GPIOStationData *)stn->data, value);
		} else if (stn->type == STN_TYPE_HTTP) {
            // transmit RF signal
			switch_httpstation((HTTPStationData *)stn->data, value);
	}
#endif    
	}
}
#else
#ifdef PORT_RF
            switch_rfstation ( stn->data, value );
#endif

		}
        else if ( stn->type==STN_TYPE_REMOTE )
        {
            // request remote station
            switch_remotestation ( stn->data, value );
        }
    }
}

#endif
#ifdef LORA

void switch_LoraStation(byte * buf, bool turnon, long dura) {
#define DEF_DURATION 36000
	DEBUG_PRINTLN(dura);
	char* staNumber = strtok((char *)buf, ",\0");
	char* valvNumber = strtok(NULL, ",\0");
	char* duration = strtok(NULL, ",\0");
	byte staN = staNumber == NULL ? 0 : atoi(staNumber);
	byte valvN = valvNumber == NULL ? 0 : atoi(valvNumber);
	long dur = dura == 0 ?  DEF_DURATION:dura;
	DEBUG_PRINTLN(staN);
	if (turnon && !valvOpen[staN])
		valvOpen[staN] = Lora.runValve(staN, valvN, dur);
	if (!turnon&&valvOpen[staN])
		valvOpen[staN] = !Lora.stopValves(staN);
	Serial.printf("ValvOpen[%d]= %d \r\n", staN, valvOpen[staN]);

}
/** Switch special station */
void OpenSprinkler::switch_special_station(byte sid, byte value, long duration) {
	// check station special bit

	if (station_attrib_bits_read(ADDR_NVM_STNSPE + (sid >> 3)) & (1 << (sid & 0x07))) {
		// read station special data from sd card
		int stepsize = sizeof(StationSpecialData);
		read_from_file(stns_filename, tmp_buffer, stepsize, sid*stepsize);
		StationSpecialData *stn = (StationSpecialData *)tmp_buffer;
		// check station type
		DEBUG_PRINT("SStype"); DEBUG_PRINTLN(stn->type);
#ifdef LORA
#define STN_TYPE_LORA 1    /// LORA replace RF station UI app need mod.
		if (stn->type == STN_TYPE_LORA) {
			// STN_TYPE_LORA==6  sd contain station number, name , otions,comma separated
			switch_LoraStation(stn->data, value, duration);
		}
		else
#endif
			if (stn->type == STN_TYPE_RF) {
				// transmit RF signal

#ifdef OS217
				switch_rfstation((RFStationData *)stn->data, value);
			}
			else if (stn->type == STN_TYPE_REMOTE) {
				// request remote station
				switch_remotestation((RemoteStationData *)stn->data, value);
			}
#if !defined(ARDUINO) || defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
		// GPIO and HTTP stations are only available for OS23 or OSPi
			else if (stn->type == STN_TYPE_GPIO) {
				// set GPIO pin
				switch_gpiostation((GPIOStationData *)stn->data, value);
			}
			else if (stn->type == STN_TYPE_HTTP) {
				// transmit RF signal
				switch_httpstation((HTTPStationData *)stn->data, value);
			}
#endif    
	}
}
#else
#ifdef PORT_RF
				switch_rfstation(stn->data, value);
#endif

		}
			else if (stn->type == STN_TYPE_REMOTE)
			{
				// request remote station
				switch_remotestation(stn->data, value);
			}
	}
}
#endif

byte OpenSprinkler::set_station_bit(byte sid, byte value,long duration)
{
	byte *data = station_bits + (sid >> 3); // pointer to the station byte
	byte mask = (byte)1 << (sid & 0x07); // mask
	if (value)
	{
		if ((*data) &mask) return 0; // if bit is already set, return no change
		else
		{
			(*data) = (*data) | mask;
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
			engage_booster = true; // if bit is changing from 0 to 1, set engage_booster
#endif
			switch_special_station(sid, 1,duration); // handle special stations
			return 1;
		}
	}
	else
	{
		if (!((*data) &mask)) return 0; // if bit is already reset, return no change
		else
		{
			(*data) = (*data) & (~mask);
			switch_special_station(sid, 0,duration); // handle special stations
			return 255;
		}
	}
	return 0;
}

#endif 
/** Set station bit
 * This function sets/resets the corresponding station bit variable
 * You have to call apply_all_station_bits next to apply the bits
 * (which results in physical actions of opening/closing valves).
 */
byte OpenSprinkler::set_station_bit ( byte sid, byte value )
{
    byte *data = station_bits+ ( sid>>3 ); // pointer to the station byte
    byte mask = ( byte ) 1<< ( sid&0x07 ); // mask
    if ( value )
    {
        if ( ( *data ) &mask ) return 0; // if bit is already set, return no change
        else
        {
            ( *data ) = ( *data ) | mask;
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
            engage_booster = true; // if bit is changing from 0 to 1, set engage_booster
#endif
            switch_special_station ( sid, 1 ); // handle special stations
            return 1;
        }
    }
    else
    {
        if ( ! ( ( *data ) &mask ) ) return 0; // if bit is already reset, return no change
        else
        {
            ( *data ) = ( *data ) & ( ~mask );
            switch_special_station ( sid, 0 ); // handle special stations
            return 255;
        }
    }
    return 0;
}

/** Clear all station bits */
void OpenSprinkler::clear_all_station_bits()
{
    byte sid;
    for ( sid=0; sid<=MAX_NUM_STATIONS; sid++ )
    {
        set_station_bit ( sid, 0 );
    }
}

