pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
#if !defined(ARDUINO)
int rf_gpio_fd = -1;
#endif

//#ifdef PORT_RF
/** Transmit one RF signal bit */
void transmit_rfbit ( ulong lenH, ulong lenL )
{
#if defined(ESP32)||defined(ESP8266)
  //////todo
#elif defined(ARDUINO)
    PORT_RF |= ( 1<<PINX_RF );
    delayMicroseconds ( lenH );
    PORT_RF &=~ ( 1<<PINX_RF );
    delayMicroseconds ( lenL );
#else
    gpio_write ( rf_gpio_fd, 1 );
    delayMicrosecondsHard ( lenH );
    gpio_write ( rf_gpio_fd, 0 );
    delayMicrosecondsHard ( lenL );
#endif
}

/** Transmit RF signal */
void send_rfsignal ( ulong code, ulong len )
{
    ulong len3 = len * 3;
    ulong len31 = len * 31;
    for ( byte n=0; n<15; n++ )
    {
        int i=23;
        // send code
        while ( i>=0 )
        {
            if ( ( code>>i ) & 1 )
            {
                transmit_rfbit ( len3, len );
            }
            else
            {
                transmit_rfbit ( len, len3 );
            }
            i--;
        };
        // send sync
        transmit_rfbit ( len, len31 );
    }
}


/** Switch RF station
 * This function takes a RF code,
 * parses it into signals and timing,
 * and sends it out through RF transmitter.
 */
#ifdef OS217
void OpenSprinkler::switch_rfstation(RFStationData *data, bool turnon) {
	ulong on, off;
	uint16_t length = parse_rfstation_code(data, &on, &off);
#else
void OpenSprinkler::switch_rfstation ( byte *code, bool turnon )
{
    ulong on, off;
    uint16_t length = parse_rfstation_code ( code, &on, &off );
#endif
#if defined(ARDUINO)
    send_rfsignal ( turnon ? on : off, length );
#else
    // pre-open gpio file to minimize overhead
    rf_gpio_fd = gpio_fd_open ( PIN_RF_DATA );
    send_rfsignal ( turnon ? on : off, length );
    gpio_fd_close ( rf_gpio_fd );
    rf_gpio_fd = -1;
#endif

}
//#endif
/** Callback function for remote station calls */
static void switchremote_callback ( byte status, uint16_t off, uint16_t len )
{
    /* do nothing */
}
#ifdef LORA


void switch_LoraStation(byte * buf, bool turnon) {
#define DEF_DURATION 36000
	char* staNumber = strtok((char *)buf, ",\0");
	char* valvNumber = strtok(NULL, ",\0");
	char* duration = strtok(NULL, ",\0");
	byte staN = staNumber == NULL ? 0 : atoi(staNumber);
	byte valvN = valvNumber == NULL ? 0 : atoi(valvNumber);
	long dur = duration == NULL ? DEF_DURATION : atol(duration);
	if (turnon&&!valvOpen[staN])
		valvOpen[staN]=Lora.runValve(staN, valvN, dur);
	if(!turnon&&valvOpen[staN])
		valvOpen[staN]=!Lora.stopValves(staN);
	Serial.printf("ValvOpen[%d]= %d \r\n",staN,valvOpen[staN]);

}
#endif
#ifdef OS217
void OpenSprinkler::switch_gpiostation(GPIOStationData *data, bool turnon) {
	byte gpio = (data->pin[0] - '0') * 10 + (data->pin[1] - '0');
	byte activeState = data->active - '0';

	pinMode(gpio, OUTPUT);
	if (turnon) {
		digitalWrite(gpio, activeState);}
	else {
		digitalWrite(gpio, 1 - activeState);
	}
}

/** Callback function for browseUrl calls */
void httpget_callback(byte status, uint16_t off, uint16_t len) {
#if defined(SERIAL_DEBUG)
	EtherCardW5100::buffer[off + ETHER_BUFFER_SIZE - 1] = 0;
	DEBUG_PRINTLN((const char*)EtherCardW5100::buffer + off);
#endif
}

/** Switch remote station
 * This function takes a remote station code,
 * parses it into remote IP, port, station index,
 * and makes a HTTP GET request.
 * The remote controller is assumed to have the same
 * password as the main controller
 */
void OpenSprinkler::switch_remotestation(RemoteStationData *data, bool turnon) {
#if defined(ARDUINO)
	// construct string
	ulong ip = hex2ulong(data->ip, sizeof(data->ip));
	ether.hisip[0] = ip >> 24;
	ether.hisip[1] = (ip >> 16) & 0xff;
	ether.hisip[2] = (ip >> 8) & 0xff;
	ether.hisip[3] = ip & 0xff;

	uint16_t _port = ether.hisport; // save current port number
	ether.hisport = hex2ulong(data->port, sizeof(data->port));

	char *p = tmp_buffer + sizeof(RemoteStationData) + 1;
	BufferFiller bf = (byte*)p;
	// MAX_NUM_STATIONS is the refresh cycle
	uint16_t timer = options[OPTION_SPE_AUTO_REFRESH] ? 2 * MAX_NUM_STATIONS : 65535;
	bf.emit_p(PSTR("?pw=$E&sid=$D&en=$D&t=$D"),
		ADDR_NVM_PASSWORD,
		(int)hex2ulong(data->sid, sizeof(data->sid)),
		turnon, timer);
	ether.browseUrl(PSTR("/cm"), p, PSTR("*"), httpget_callback);
	for (int l = 0; l<100; l++)  ether.packetLoop(ether.packetReceive());
	ether.hisport = _port;
#else
	EthernetClient client;

	uint8_t hisip[4];
	uint16_t hisport;
	ulong ip = hex2ulong(data->ip, sizeof(data->ip));
	hisip[0] = ip >> 24;
	hisip[1] = (ip >> 16) & 0xff;
	hisip[2] = (ip >> 8) & 0xff;
	hisip[3] = ip & 0xff;
	hisport = hex2ulong(data->port, sizeof(data->port));

	if (!client.connect(hisip, hisport)) {
		client.stop();
		return;
	}

	char *p = tmp_buffer + sizeof(RemoteStationData) + 1;
	BufferFiller bf = p;
	// MAX_NUM_STATIONS is the refresh cycle
	uint16_t timer = options[OPTION_SPE_AUTO_REFRESH] ? 2 * MAX_NUM_STATIONS : 65535;
	bf.emit_p(PSTR("GET /cm?pw=$E&sid=$D&en=$D&t=$D"),
		ADDR_NVM_PASSWORD,
		(int)hex2ulong(data->sid, sizeof(data->sid)),
		turnon, timer);
	bf.emit_p(PSTR(" HTTP/1.0\r\nHOST: *\r\n\r\n"));

	client.write((uint8_t *)p, strlen(p));

	bzero(ether_buffer, ETHER_BUFFER_SIZE);

	time_t timeout = now() + 5; // 5 seconds timeout
	while (now() < timeout) {
		int len = client.read((uint8_t *)ether_buffer, ETHER_BUFFER_SIZE);
		if (len <= 0) {
			if (!client.connected())
				break;
			else
				continue;
		}
		httpget_callback(0, 0, ETHER_BUFFER_SIZE);
	}
	client.stop();
#endif
}

/** Switch http station
* This function takes an http station code,
* parses it into a server name and two HTTP GET requests.
*/
void OpenSprinkler::switch_httpstation(HTTPStationData *data, bool turnon) {

	static HTTPStationData copy;
	// make a copy of the HTTP station data and work with it
	memcpy((char*)&copy, (char*)data, sizeof(HTTPStationData));
	char * server = strtok((char *)copy.data, ",");
	char * port = strtok(NULL, ",");
	char * on_cmd = strtok(NULL, ",");
	char * off_cmd = strtok(NULL, ",");
	char * cmd = turnon ? on_cmd : off_cmd;

#if defined(ARDUINO)

	if (!ether.dnsLookup(server, true)) {
		char *ip0 = strtok(server, ".");
		char *ip1 = strtok(NULL, ".");
		char *ip2 = strtok(NULL, ".");
		char *ip3 = strtok(NULL, ".");

		ether.hisip[0] = ip0 ? atoi(ip0) : 0;
		ether.hisip[1] = ip1 ? atoi(ip1) : 0;
		ether.hisip[2] = ip2 ? atoi(ip2) : 0;
		ether.hisip[3] = ip3 ? atoi(ip3) : 0;
	}

	uint16_t _port = ether.hisport;
	ether.hisport = atoi(port);
	ether.browseUrl(PSTR("/"), cmd, server, httpget_callback);
	for (int l = 0; l<100; l++)  ether.packetLoop(ether.packetReceive());
	ether.hisport = _port;

#else

	EthernetClient client;
	struct hostent *host;

