pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
        nvm_write_block ( tmp_buffer, ( void* ) ADDR_NVM_MAS_OP, MAX_EXT_BOARDS+1 );
        nvm_write_block ( tmp_buffer, ( void* ) ADDR_NVM_STNSEQ, MAX_EXT_BOARDS+1 );

        // 5. delete sd file
        remove_file ( wtopts_filename );

        // 6. write options
        options_save(); // write default option values
		DEBUG_PRINTLN("done");
        //======== END OF NVM RESET CODE ========

        // restart after resetting NVM.
        delay ( 500 );
#if defined(ARDUINO)
        reboot_dev();
#endif
    }

    {
        // load ram parameters from nvm
        // load options
        options_load();

        // load non-volatile controller data
        nvdata_load();
    }

#if defined(ARDUINO)  // handle AVR buttons
    byte button = button_read ( BUTTON_WAIT_NONE );
	DEBUG_PRINT(button);
//	button = 2;
	byte ii = 1;

	switch (button & BUTTON_MASK)
	{

	case BUTTON_1:
		// if BUTTON_1 is pressed during startup, go to 'reset all options'
		ui_set_options(OPTION_RESET);
		if (options[OPTION_RESET])
		{
			reboot_dev();
		}
		break;

	case BUTTON_2:  // button 2 is used to enter bootloader
		ether.netflag = true;
		lcd_print_line_clear_pgm(PSTR("==Change Network=="), 0);
		delay(DISPLAY_MSG_MS);

		break;

    case BUTTON_3:
        // if BUTTON_3 is pressed during startup, enter Setup option mode
        lcd_print_line_clear_pgm ( PSTR ( "==Set Options==" ), 0 );
        delay ( DISPLAY_MSG_MS );
        lcd_print_line_clear_pgm ( PSTR ( "B1/B2:+/-, B3:->" ), 0 );
        lcd_print_line_clear_pgm ( PSTR ( "Hold B3 to save" ), 1 );
        do
        {
            button = button_read ( BUTTON_WAIT_NONE );
        }
        while ( ! ( button & BUTTON_FLAG_DOWN ) );
#ifndef LCD_SSD1306
		lcd.clear();
#else
		lcd.clearDisplay();
#endif
        ui_set_options ( 0 );
        if ( options[OPTION_RESET] )
        {
            reboot_dev();
        }
        break;
    }

    // turn on LCD backlight and contrast
    lcd_set_brightness();
    lcd_set_contrast();

    if ( !button )
	{
		DEBUG_PRINT("no but");
        // flash screen
        lcd_print_line_clear_pgm ( PSTR ( " OpenSprinkler" ),0 );
        lcd.setCursor ( 2*XFACTOR, 1*YFACTOR );
        lcd_print_pgm ( PSTR ( "HW v" ) );
        byte hwv = options[OPTION_HW_VERSION];
        lcd.print ( ( char ) ( '0'+ ( hwv/10 ) ) );
        lcd.print ( '.' );
        lcd.print ( ( char ) ( '0'+ ( hwv%10 ) ) );
        switch ( hw_type )
        {
        case HW_TYPE_DC:
            lcd_print_pgm ( PSTR ( " DC" ) );
            break;
        case HW_TYPE_LATCH:
            lcd_print_pgm ( PSTR ( " LA" ) );
            break;
        default:
            lcd_print_pgm ( PSTR ( " AC" ) );
        }

#ifdef LCD_SSD1306
		lcd.display();
#endif
        //delay ( 1000 );
    }
#endif
}

/** Load non-volatile controller status data from internal NVM */
void OpenSprinkler::nvdata_load(){
    nvm_read_block ( &nvdata, ( void* ) ADDR_NVM_NVCONDATA, sizeof ( NVConData ) );
    old_status = status;
}

/** Save non-volatile controller status data to internal NVM */
void OpenSprinkler::nvdata_save(){
    nvm_write_block ( &nvdata, ( void* ) ADDR_NVM_NVCONDATA, sizeof ( NVConData ) );

}

/** Load options from internal NVM */
void OpenSprinkler::options_load(){
    nvm_read_block ( tmp_buffer, ( void* ) ADDR_NVM_OPTIONS, NUM_OPTIONS );
    for ( int i=0; i<NUM_OPTIONS; i++ ) {
        options[i] = tmp_buffer[i];
    }
    nboards = options[OPTION_EXT_BOARDS]+1;
    nstations = nboards * 8;
    status.enabled = options[OPTION_DEVICE_ENABLE];
    options[OPTION_FW_MINOR] = OS_FW_MINOR;
}

/** Save options to internal NVM */
void OpenSprinkler::options_save(){
    // save options in reverse order so version number is written the last
  for (int i=NUM_OPTIONS-1; i>=0; i--) {
        tmp_buffer[i] = options[i];
    }
	DEBUG_PRINT("OptionsWrite OS:"); DEBUG_PRINTLN((int)options[0]);
    nvm_write_block ( tmp_buffer, ( void* ) ADDR_NVM_OPTIONS, NUM_OPTIONS );
	DEBUG_PRINTLN((int)eeprom_read_byte((byte *)ADDR_NVM_OPTIONS));
    nboards = options[OPTION_EXT_BOARDS]+1;
    nstations = nboards * 8;
    status.enabled = options[OPTION_DEVICE_ENABLE];
}

// ==============================
// Controller Operation Functions
// ==============================

/** Enable controller operation */
void OpenSprinkler::enable(){
    status.enabled = 1;
    options[OPTION_DEVICE_ENABLE] = 1;
    options_save();
}

/** Disable controller operation */
void OpenSprinkler::disable(){
    status.enabled = 0;
    options[OPTION_DEVICE_ENABLE] = 0;
    options_save();
}

/** Start rain delay */
void OpenSprinkler::raindelay_start(){
    status.rain_delayed = 1;
    nvdata_save();
}

/** Stop rain delay */
void OpenSprinkler::raindelay_stop(){
    status.rain_delayed = 0;
    nvdata.rd_stop_time = 0;
    nvdata_save();
}

/** LCD and button functions */
void OpenSprinkler::lcd_clear() {
#ifndef LCD_SSD1306
	lcd.clear();
#else
	lcd.clearDisplay();
#endif
}
#if defined(ARDUINO)    // AVR LCD and button functions
/** print a program memory string */
void OpenSprinkler::lcd_print_pgm ( PGM_P /*PROGMEM*/ str ){
    uint8_t c;
    while ( ( c=pgm_read_byte ( str++ ) ) != '\0' ){
        lcd.print ( ( char ) c );
    }
#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print a program memory string to a given line with clearing */
void OpenSprinkler::lcd_print_line_clear_pgm ( PGM_P /*PROGMEM*/ str, byte line ){
    lcd.setCursor ( 0, line*YFACTOR );
    uint8_t c;
    int8_t cnt = 0;
    while ( ( c=pgm_read_byte ( str++ ) ) != '\0' ){
        lcd.print ( ( char ) c );
        cnt++;
    }
    for ( ; ( 16-cnt ) >= 0; cnt ++ ) lcd_print_pgm ( PSTR ( " " ) );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}
//  Csaba print Sensor      print Sensor on SD1306 graphic 128 64 display

void OpenSprinkler::lcd_print_2digit ( int v )
{
    lcd.print ( ( int ) ( v/10 ) );
    lcd.print ( ( int ) ( v%10 ) );
}

/** print time to a given line */
void OpenSprinkler::lcd_print_time ( time_t t )
{
    lcd.setCursor ( 0, 0 );
    lcd_print_2digit ( hour ( t ) );

#ifdef OPENSPRINKLER_ARDUINO_HEARTBEAT
    lcd_print_pgm ( ( t % 2 == 0 ? PSTR ( ":" ) : PSTR ( " " ) ) );
#else
    lcd_print_pgm ( PSTR ( ":" ) );
#endif // OPENSPRINKLER_ARDUINO_HEARTBEAT

