pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
    lcd_print_2digit ( minute ( t ) );
    lcd_print_pgm ( PSTR ( "  " ) );
    // each weekday string has 3 characters + ending 0
    lcd_print_pgm ( days_str+4*weekday_today() );
    lcd_print_pgm ( PSTR ( " " ) );
    lcd_print_2digit ( month ( t ) );
    lcd_print_pgm ( PSTR ( "-" ) );
    lcd_print_2digit ( day ( t ) );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print ip address */
void OpenSprinkler::lcd_print_ip ( const byte *ip, byte endian ){

    lcd_clear();

    lcd.setCursor ( 0, 0 );
    for ( byte i=0; i<4; i++ )
    {
        lcd.print ( endian ? ( int ) ip[3-i] : ( int ) ip[i] );
        if ( i<3 ) lcd_print_pgm ( PSTR ( "." ) );
    }

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print mac address */
void OpenSprinkler::lcd_print_mac ( const byte *mac ){
    lcd.setCursor ( 0, 0 );
    for ( byte i=0; i<6; i++ ){
        if ( i )  lcd_print_pgm ( PSTR ( "-" ) );
        lcd.print ( ( mac[i]>>4 ), HEX );
        lcd.print ( ( mac[i]&0x0F ), HEX );
        if ( i==4 ) lcd.setCursor ( 0, YFACTOR );
    }
    lcd_print_pgm ( PSTR ( " (MAC)" ) );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print station bits */
void OpenSprinkler::lcd_print_station(byte line, char c){
#ifdef LCD_SSD1306
	lcd.setTextSize(2);
#endif
	lcd.setCursor(0, line*YFACTOR);
	if (status.display_board == 0){
		lcd_print_pgm(PSTR("MC")); // Master controller is display as 'MC'
	}
	else {
		lcd_print_pgm(PSTR("E"));
		lcd.print((int)status.display_board);
		lcd_print_pgm(PSTR("")); // extension boards are displayed as E1, E2...
	}

	if (!status.enabled){
		lcd_print_line_clear_pgm(PSTR("-Disabled!-"), 1);
	} else {
		byte xchar = 2;
		byte bitvalue = station_bits[status.display_board];
		for (byte s = 0; s < 8; s++){
			byte sid = (byte)status.display_board << 3;
			sid += (s + 1);
			if (sid == options[OPTION_MASTER_STATION]){
#ifndef LCD_SSD1306x
				lcd.print((bitvalue & 1) ? (char)c : 'M'); // print master station
#else
				lcd.drawBitmap(2 * XFACTOR*xchar++, YFACTOR, (bitvalue & 1) ? valveOpen10x16_bmp : valveClosed10x16_bmp, 10, 16, WHITE);
#endif
			}else if (sid == options[OPTION_MASTER_STATION_2]){
				lcd.print((bitvalue & 1) ? (char)c : 'N'); // print master2 station
			}else{
// ------------if station is disabled -------------------------------------------
				if(station_attrib_bits_read ( ADDR_NVM_STNDISABLE ) & ( 1<<s ) )lcd.print((bitvalue & 1) ? (char)c : '-'); // print master station
				else
//----------normal active station
				lcd.print((bitvalue & 1) ? (char)c : '_'); // print master station

//				lcd.drawBitmap(2 * XFACTOR*xchar++, YFACTOR, (bitvalue & 1) ? valveOpen10x16_bmp : valveClosed10x16_bmp, 10, 16, WHITE);

			}
			bitvalue >>= 1;
		}
	}
#ifndef LCD_SSD1306
	lcd_print_pgm(PSTR("     "));
	lcd.setCursor(12, 1);

	if (options[OPTION_REMOTE_EXT_MODE])
	{
		lcd.write(5);
	}
	lcd.setCursor(13 , 1);
#endif

	if (status.rain_delayed || (status.rain_sensed && options[OPTION_SENSOR_TYPE] == SENSOR_TYPE_RAIN))
	{
#ifndef LCD_SSD1306
		
		lcd.write(3);
#else
		lcd.drawBitmap(117, 0, rain10x10_bmp, 10, 10, WHITE);
#endif

	}
	if (options[OPTION_SENSOR_TYPE] == SENSOR_TYPE_FLOW)
	{
		lcd.write(6);
	}

	if (status.has_sd)
	{

#ifndef LCD_SSD1306
		lcd.setCursor(14, 1);
		lcd.write(2);
#else
		lcd.drawBitmap(16*XFACTOR, 0, sdisk10x10_bmp, 10, 10, WHITE);
#endif
	}

#ifndef LCD_SSD1306
	lcd.setCursor(15, 1);
	lcd.write(status.network_fails>2 ? 1 : 0); // if network failure detection is more than 2, display disconnect icon
#else
	lcd.drawBitmap(18*XFACTOR, 0, antenna5x9_bmp, 5, 9, WHITE);
#endif
    
#ifdef LCD_SSD1306
	lcd.display();
	lcd.setTextSize(1);
#endif
}

/** print a version number */
void OpenSprinkler::lcd_print_version ( byte v )
{
    if ( v > 99 )
    {
        lcd.print ( v/100 );
        lcd.print ( "." );
    }
    if ( v>9 )
    {
        lcd.print ( ( v/10 ) %10 );
        lcd.print ( "." );
    }
    lcd.print ( v%10 );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print an option value */
void OpenSprinkler::lcd_print_option ( int i )
{
    // each prompt string takes 16 characters
    strncpy_P0 ( tmp_buffer, op_prompts+16*i, 16 );
    lcd.setCursor ( 0, 0 );
    lcd.print ( tmp_buffer );
    lcd_print_line_clear_pgm ( PSTR ( "" ), 1 );
    lcd.setCursor ( 0, YFACTOR );
    int tz;
    switch ( i )
    {
    case OPTION_HW_VERSION:
        lcd.print ( "v" );
    case OPTION_FW_VERSION:
        lcd_print_version ( options[i] );
        break;
    case OPTION_TIMEZONE: // if this is the time zone option, do some conversion
        tz = ( int ) options[i]-48;
        if ( tz>=0 ) lcd_print_pgm ( PSTR ( "+" ) );
        else
        {
            lcd_print_pgm ( PSTR ( "-" ) );
            tz=-tz;
        }
        lcd.print ( tz/4 ); // print integer portion
        lcd_print_pgm ( PSTR ( ":" ) );
        tz = ( tz%4 ) *15;
        if ( tz==0 )  lcd_print_pgm ( PSTR ( "00" ) );
        else
        {
            lcd.print ( tz ); // print fractional portion
        }
        break;
    case OPTION_MASTER_ON_ADJ:
    case OPTION_MASTER_ON_ADJ_2:
        lcd_print_pgm ( PSTR ( "+" ) );
        lcd.print ( ( int ) options[i] );
        break;
    case OPTION_MASTER_OFF_ADJ:
    case OPTION_MASTER_OFF_ADJ_2:
        if ( options[i]>=60 )  lcd_print_pgm ( PSTR ( "+" ) );
        lcd.print ( ( int ) options[i]-60 );
        break;
    case OPTION_HTTPPORT_0:
        lcd.print ( ( unsigned int ) ( options[i+1]<<8 )+options[i] );
        break;
    case OPTION_PULSE_RATE_0:
    {
        uint16_t fpr = ( unsigned int ) ( options[i+1]<<8 )+options[i];
        lcd.print ( fpr/100 );
        lcd_print_pgm ( PSTR ( "." ) );
        lcd.print ( ( fpr/10 ) %10 );
        lcd.print ( fpr%10 );
    }
    break;
    case OPTION_STATION_DELAY_TIME:
        lcd.print ( water_time_decode_signed ( options[i] ) );
        break;
    case OPTION_LCD_CONTRAST:
        lcd_set_contrast();
        lcd.print ( ( int ) options[i] );
        break;
    case OPTION_LCD_BACKLIGHT:
        lcd_set_brightness();
        lcd.print ( ( int ) options[i] );
        break;
    case OPTION_BOOST_TIME:
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
        if ( hw_type==HW_TYPE_AC )
        {
            lcd.print ( '-' );
        }
        else
        {
            lcd.print ( ( int ) options[i]*4 );
            lcd_print_pgm ( PSTR ( " ms" ) );
        }
#else
        lcd.print ( '-' );
#endif
        break;
    default:
        // if this is a boolean option
        if ( pgm_read_byte ( op_max+i ) ==1 )
            lcd_print_pgm ( options[i] ? PSTR ( "Yes" ) : PSTR ( "No" ) );
        else
            lcd.print ( ( int ) options[i] );
        break;
    }
    if ( i==OPTION_WATER_PERCENTAGE )  lcd_print_pgm ( PSTR ( "%" ) );
    else if ( i==OPTION_MASTER_ON_ADJ || i==OPTION_MASTER_OFF_ADJ || i==OPTION_MASTER_ON_ADJ_2 || i==OPTION_MASTER_OFF_ADJ_2 )
        lcd_print_pgm ( PSTR ( " sec" ) );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** Button functions */

#ifdef BUTTON_ADC_PIN
// Wait for button
byte OpenSprinkler::button_read_busy ( byte pin_butt, byte waitmode, byte butt, byte is_holding )
{

