pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
}

/** Set LCD contrast (using PWM) */
void OpenSprinkler::lcd_set_contrast()
{
#ifndef OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
#ifndef LCDI2C
    // set contrast is only valid for standard LCD
    if ( lcd.type() ==LCD_STD )
    {
        pinMode ( PIN_LCD_CONTRAST, OUTPUT );
        analogWrite ( PIN_LCD_CONTRAST, options[OPTION_LCD_CONTRAST] );
    }
#endif
#endif

}

/** Set LCD brightness (using PWM) */
void OpenSprinkler::lcd_set_brightness ( byte value )
{
#ifdef OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
	// value of 1 = on bright / 0 = dim
    pinMode ( PIN_LCD_BACKLIGHT, OUTPUT );
	if (value == 1)
		LCD_BACKLIGHT_ON();
	else
		LCD_BACKLIGHT_OFF();
#else
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
#ifndef LCDI2C
    if ( lcd.type() ==LCD_I2C )
    {
        if ( value ) lcd.backlight();
        else lcd.noBacklight();
    }

#endif
#endif
#ifndef LCDI2C
    if ( lcd.type() ==LCD_STD )
    {
        pinMode ( PIN_LCD_BACKLIGHT, OUTPUT );
        if ( value )
        {
            analogWrite ( PIN_LCD_BACKLIGHT, 255-options[OPTION_LCD_BACKLIGHT] );
        }
        else
        {
            analogWrite ( PIN_LCD_BACKLIGHT, 255-options[OPTION_LCD_DIMMING] );
        }
    }
#else
#ifndef LCD_SSD1306
	if (value == 1)
		digitalWrite(PIN_LCD_BACKLIGHT, LOW);
	else
		digitalWrite(PIN_LCD_BACKLIGHT, HIGH);
#endif
#endif
#endif // OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
}
#endif  // end of LCD and button functions

#ifdef OPENSPRINKLER_ARDUINO_FREEMEM
// ==================
// Print free memory for debugging
// ==================
void OpenSprinkler::lcd_print_memory ( byte line )
{
    lcd.setCursor ( 0, line );
    lcd_print_pgm ( PSTR ( "Free RAM:        " ) );

    lcd.setCursor ( 10, line );
    lcd.print ( freeMemory() );

    lcd.setCursor ( 15, line );
    lcd.write ( status.network_fails>0 ? 1 : 0 );
}
#endif

